# /etc/zshrc: Το παρόν αρχείο διαβάζεται μόνο σε περίπτωση διαδραστικού
# κέλυφους οπότε μπορεί να περιέχει και εντολές που παράγουν έξοδο

# vim:filetype=zsh:foldmethod=marker
################################################################
# Ο κάθε marker ανοίγει με zo και κλείνει με zc. Το zR ανοίγει #
# όλους τους markers ταυτόχρονα ενώ το zM τους κλείνει.        #
################################################################

# Δήλωση του prompt {{{

# Το κλασσικό prompt:
PS1='%n@%m:%~%# '
PS2='> '
export PS1 PS2

# Παράμετροι του prompt # {{{
# %% = %
# %) = )
# %l = tty
# %M = full hostname
# %m = hostname
# %n = username
# %# = # για τον root, % για απλό χρήστη
# %? = η κατάσταση της προηγούμενης εντολής
# %_ = η κατάσταση του parser (χρησιμεύει στο PS2)
# %d ή %/ = τρέχων κατάλογος
# %~ = τρέχων κατάλογος αλλά με εμφάνιση των δηλωμένων καταλόγων πχ $HOME=~
# %h ή %! = ο αριθμός της εντολής στο ιστορικό
# %j = ο αριθμός των εργασιών που εκτελούνται στο παρασκήνιο
# %L = η τρέχουσα τιμή του $SHLVL
# %D = ημερομηνία με μορφή yy-mm-dd
# %W = ημερομηνία με μορφή mm/dd/yy
# %T = ώρα με 24ωρη μορφή
# %* = ^ ^ ^  με εμφάνιση δευτερολέπτων
# %D{string} = ημερομηνία με μορφή δικής μας επιλογής (με βάση την strftime)
#              π.χ %D{%d/%m/%y} = ημερομηνία με μορφή ηη/μμ/χχ
# %B %b = Εκκίνηση/Τερματισμός τονισμού
# %U %u = Εκκίνηση/Τερματισμός υπογράμμισης
# %F %f = Εκκίνηση/Τερματισμός χρώματος του προσκήνιου π.χ %F{red}
# %K %k = ^ ^ ^ για παρασκήνιο
# %{ %} = Το περιεχόμενο δεν απαιτεί χώρο οπότε δεν αλλάζει τη τιμή του κέρσορα
# }}}

# }}}

# Λειτουργίες πλήκτρων {{{

bindkey -e
bindkey "\e[1~" beginning-of-line
bindkey "\e[4~" end-of-line
bindkey "\e[7~" beginning-of-line
bindkey "\e[8~" end-of-line
bindkey "\eOH" beginning-of-line
bindkey "\eOF" end-of-line
bindkey "\e[H" beginning-of-line
bindkey "\e[F" end-of-line
bindkey "\e[2~" quoted-insert
bindkey "\e[3~" delete-char
bindkey "\e[5~" beginning-of-history
bindkey "\e[6~" end-of-history

# }}}

# Δήλωση μεταβλητών {{{
# Οι παρακάτω μεταβλητές έχουν νόημα μόνο σε διαδραστικά κελύφη οπότε
# δηλώνονται εδώ

# Έλεγχος νέων e-mail κάθε 300 δευτερόλεπτα
export MAILCHECK=300

# Μετά από 900 δευτερόλεπτα αδράνειας το κέλυφος δέχεται σήμα ALRM. Αν το
# σήμα δεν έχει γίνει TRAP τότε θα αποσυνδέσει τον χρήστη
# TMOUT=900

# Αν ένα πρόγραμμα εκτελείται για μεγαλύτερο χρόνο από 60 δευτερόλεπτα
# θα τυπώνονται στατιστικά για την χρήση cpu του
# export REPORTTIME=60

# Εμφανίζει μήνυμα κάθε 30 δευτερόλεπτα με όσους χρήστες έχουν μπει/βγει
# (όσους έχουν οριστεί στην μεταβλητή watch)
export LOGCHECK=30

# Έλεγχος της εισόδου/εξόδου όλων των άλλων χρηστών
watch=(notme)
# Έλεγχος της εισόδου/εξόδου όλων των χρηστών
# watch=(all)
WATCHFMT='%n %a %l from %M'
# Παράμετροι του watch # {{{
# %n = Το όνομα χρήστη (username)
# %a = Τύπος δράσης (logged on, logged off)
# %l = Το tty στο οποίο συνδέθηκε ο χρήστης
# %M = Το ολοκληρωμένο hostname
# %m = Το hostname μέχρι την πρώτη .
# %U %u = Αρχή/Τέλος υπογραμμισμένου κειμένου
# %B %b = Αρχή/Τέλος κεφαλαίου (bold) κειμένου
# %T = Ώρα σε 24h μορφή
# %W = Ημερομηνία με μορφή mm/dd/yy
# %D = Ημερομηνία με μορφή yy-mm-dd
# }}}

# Όταν έχει δηλωθεί μια συνάρτηση με το όνομα precmd αυτή καλείται πριν να
# εμφανιστεί το prompt. Παρόμοια, η preexec καλείται πριν να εκτελεστεί μια
# εντολή. Οι παρακάτω εντολές εμφανίζουν στον τίτλο του τερματικού τον
# τρέχοντα κατάλογο και την εντολή που εκτελείται αυτή την στιγμή
if [[ $TERM == *xterm* ]]; then
	precmd () {
		print -Pn "\e]0;%n@%m:%~ \a"
	}

	preexec () {
		print -Pn "\e]0;%n@%m:%~ <$1>\a"
	}
fi

# Ορίζει χρώματα στο less για εμφάνιση χρωματιστών manpages
# Ο έλεγχος θα μπορούσε επίσης να επιτευχθεί με την εντολή echoti colors
if [[ $terminfo[colors] -gt 2 ]]; then
	export LESS_TERMCAP_mb=$'\E[01;31m'
	export LESS_TERMCAP_md=$'\E[01;31m'
	export LESS_TERMCAP_me=$'\E[0m'
	export LESS_TERMCAP_se=$'\E[0m'
	#export LESS_TERMCAP_so=$'\E[01;44;33m'
	export LESS_TERMCAP_ue=$'\E[0m'
	export LESS_TERMCAP_us=$'\E[01;32m'
fi

# }}}
